examples_free_decay/heave/mesh_1x/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(inlet|outlet)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    bottom
    {
        type            slip;
        //type            epsilonWallFunction;
        //value           $internalField;
    }

    "(baffle.*)"
    {
        type            cyclic;
    }

    "(object.*)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
